wave1.yml
config:
    target: "{{ $processEnvironment.SERVICE_END_POINT }}"
    phases:
        - duration: 10
          arrivalRate: 1
        - duration: 120
          arrivalRate: 10
          rampTo: 50
          name: "Warm up the application"
    processor: "./randomizer.js"
scenarios:
    - flow:
        - function: "generateRandomData"
        - post:
            url: "/rides"
            json:
                riderId: "{{ randomRiderId }}"
                bookingLocation:
                    N: "{{ randomBookingLocN }}"
                    W: "{{ randomBookingLocW }}"
                targetLocation:
                    N: "{{ randomTargetLocN }}"
                    W: "{{ randomTargetLocW }}"
            capture:
                json: "$.rideId"
                as: "rideId"
        - log: "Sending a request with rideId {{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - get:
            url: "/rides/{{ rideId }}"
        - log: "Sending a request with riderId {{ rideId }} with booking loc ({{ randomBookingLocN }}, {{ randomBookingLocW }}), target loc ({{ randomTargetLocN }}, {{ randomTargetLocW }})"